TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ГруппыТС/гкс_ГруппыТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ГруппыТС</name>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйРазмерГруппы</name>
    <comment>Ограничение по колчеству участников</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГоловаГруппы</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>по универсальному времени</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущаяГруппа</name>
    <type>
      <types>CatalogRef.гкс_ГруппыТС</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГруппыПоставщика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СоставГруппТранспорта/гкс_СоставГруппТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СоставГруппТранспорта</name>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГруппаТС</name>
    <type>
      <types>CatalogRef.гкс_ГруппыТС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияТранспорта</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации/гкс_ПоказателиУсиленногоКонтроляПоРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПоказателиУсиленногоКонтроляПоРегистрации</name>
  <resources>
    <name>ЗначениеПоказателяМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателяМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Базис</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СостояниеКачества</name>
    <type>
      <types>EnumRef.гкс_СостоянияКачества</types>
    </type>
  </resources>
  <resources>
    <name>ОтклонятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛабораторныйАнализ</name>
    <type>
      <types>DocumentRef.гкс_ЛабораторныйАнализ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеИспользования</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПробы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроб</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СтатусыЛабораторногоАнализа/гкс_СтатусыЛабораторногоАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СтатусыЛабораторногоАнализа</name>
  <enumValues>
    <name>ОтборПробы</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ПовторныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтмена</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/гкс_НазначенияИспользованияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НазначенияИспользованияКачества</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ЭлеваторВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>ЛаборантВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>КомпозитВнешниеПробыНаТысячуТон</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ПерепроверкаВнешнихПроб</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РегистрацияНаПЛК/гкс_РегистрацияНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияНаПЛК</name>
  <basedOn>Document.гкс_ВъездНаКПП</basedOn>
  <registerRecords>AccumulationRegister.гкс_СДИЗНаПЛК</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПолучатель</name>
    <comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВъезда</name>
    <comment>Точка маршрута для определения проезда</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ИДРейса</name>
    <comment>ERP-2176</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроляСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесоваяВъезда</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОтгрузкуПродукции</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаСОдногоБорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.гкс_ПрибытиеСуднаНаПЛК</types>
      <types>DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</types>
      <types>DocumentRef.гкс_ВъездНаКПП</types>
      <types>DocumentRef.гкс_СРПВПрибытиеНаПуть</types>
    </type>
  </attributes>
  <attributes>
    <name>СДИЗ</name>
    <type>
      <types>CatalogRef.гкс_СДИЗЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ГруппыТС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет регистрацию в группу по усиленному контролю,
// если регистрация уже принадлежит группе, то возвращает ссылку на существующую.
// Если группы нет, то пытыемся создать новую
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК -Документ регистрации
//  ПроизводственныеСутки - Дата - Производственные сутки
//  КоличествоТС - Число - количество транспортных средсв для новой группы
// 
// Возвращаемое значение:
//  СправочникСсылка.гкс_ГруппыТС - группа в которую попала регистрация
//
Функция ОпределитьРегистрациюВГруппу(ДокументРегистрации, ПроизводственныеСутки, КоличествоТС) Экспорт
	
	ГруппаРегистрации = ГруппаРегистрации(ДокументРегистрации);
	
	Если ЗначениеЗаполнено(ГруппаРегистрации) Тогда
	    Возврат ГруппаРегистрации;	
	КонецЕсли;
	
	ПодборГруппы = ПодборГруппыТС(ДокументРегистрации, ПроизводственныеСутки, КоличествоТС);
		
	Если Не (ЗначениеЗаполнено(ПодборГруппы.Текущая)
		И ВозможноДобавлениеВГруппуПоРазмеру(ПодборГруппы.Текущая)) Тогда  												// первая группа           
		
		ГруппаРегистрации = НоваяГруппаУсиленногоКонтроля(ДокументРегистрации, ПроизводственныеСутки, 
														ПодборГруппы.Текущая, КоличествоТС);		
	Иначе
		ГруппаРегистрации = ПодборГруппы.Текущая;												
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаРегистрации) Тогда 
		ДобавитьВСоставГруппы(ДокументРегистрации, ГруппаРегистрации);
	КонецЕсли;	

	Возврат ГруппаРегистрации;
	
КонецФункции

// Подбор группы транспортных средств для регистрации по условиям.
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - Документ регистрации транспорта
//  ПроизводственныеСутки - Дата - Производственные сутки
//  КоличествоТС - Число - Количество ТС
// 
// Возвращаемое значение:
//  Структура:
//		*Текущая - СправочникСсылка.гкс_ГруппыТС - подобранная группа
//		*Предыдущая - СправочникСсылка.гкс_ГруппыТС - группа перед подобранной
//
Функция ПодборГруппыТС(ДокументРегистрации, ПроизводственныеСутки, КоличествоТС) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Текущая", ПустаяСсылка());
	Результат.Вставить("Предыдущая", ПустаяСсылка());
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	ГруппыТС.Ссылка КАК Ссылка,
		|	ГруппыТС.ДатаСоздания КАК ДатаСоздания,
		|	ГруппыТС.ГоловаГруппы КАК ГоловаГруппы,
		|	ГруппыТС.МаксимальныйРазмерГруппы КАК МаксимальныйРазмерГруппы
		|ИЗ
		|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ГруппыТС КАК ГруппыТС
		|		ПО РегистрацияНаПЛК.Контрагент = ГруппыТС.Контрагент
		|			И РегистрацияНаПЛК.ТочкаМаршрута = ГруппыТС.ТочкаМаршрута
		|			И РегистрацияНаПЛК.Номенклатура = ГруппыТС.Номенклатура
		|			И (РегистрацияНаПЛК.Ссылка = &ДокументРегистрации)
		|			И (ГруппыТС.ПроизводственныеСутки = &ПроизводственныеСутки)
		|			И (ГруппыТС.МаксимальныйРазмерГруппы <= &МаксимальныйРазмерГруппы)
		|ГДЕ
		|	ГруппыТС.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаСоздания УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	Запрос.УстановитьПараметр("ПроизводственныеСутки", ПроизводственныеСутки); 
	Запрос.УстановитьПараметр("МаксимальныйРазмерГруппы", КоличествоТС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		ВыборкаДетальныеЗаписи.Следующий();
		Результат.Текущая = ВыборкаДетальныеЗаписи.Ссылка;
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Результат.Предыдущая = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

// Возвращает текущую группу регистрации
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - Документ регистрации
// 
// Возвращаемое значение:
//  СправочникСсылка.гкс_ГруппыТС - Группа регистрации
//
Функция ГруппаРегистрации(ДокументРегистрации) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоставГруппТранспорта.ГруппаТС КАК ГруппаТС
		|ИЗ
		|	РегистрСведений.гкс_СоставГруппТранспорта КАК СоставГруппТранспорта
		|ГДЕ
		|	СоставГруппТранспорта.РегистрацияТранспорта = &РегистрацияТранспорта";
	
	Запрос.УстановитьПараметр("РегистрацияТранспорта", ДокументРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.ГруппаТС;
	Иначе
		Возврат ПустаяСсылка();
	КонецЕсли;

КонецФункции

// Возвращает все регистрации группы документа
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - Документ регистрации
// 
// Возвращаемое значение:
//  Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - ссылки на все документы группы
//
Функция СоставГруппыПоРегистрации(ДокументРегистрации) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СоставГруппТранспорта.ГруппаТС КАК ГруппаТС
		|ПОМЕСТИТЬ ВТ_ГруппыТС
		|ИЗ
		|	РегистрСведений.гкс_СоставГруппТранспорта КАК СоставГруппТранспорта
		|ГДЕ
		|	СоставГруппТранспорта.РегистрацияТранспорта = &ДокументРегистрации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоставГруппТранспорта.РегистрацияТранспорта КАК РегистрацияТранспорта
		|ИЗ
		|	ВТ_ГруппыТС КАК ВТ_ГруппыТС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СоставГруппТранспорта КАК СоставГруппТранспорта
		|		ПО ВТ_ГруппыТС.ГруппаТС = СоставГруппТранспорта.ГруппаТС";
	
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("РегистрацияТранспорта");
	Иначе
		Результат = Новый Массив;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Определяет текущее количество участников группы.
// 
// Параметры:
//  ГруппаТС - СправочникСсылка.гкс_ГруппыТС - Группа ТС
// 
// Возвращаемое значение:
//  Число - Текущий размер группы
Функция ТекущийРазмерГруппы(ГруппаТС) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоставГруппТранспорта.РегистрацияТранспорта) КАК РазмерГруппы
		|ИЗ
		|	РегистрСведений.гкс_СоставГруппТранспорта КАК СоставГруппТранспорта
		|ГДЕ
		|	СоставГруппТранспорта.ГруппаТС = &ГруппаТС";
	
	Запрос.УстановитьПараметр("ГруппаТС", ГруппаТС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.РазмерГруппы;
	КонецЕсли;

КонецФункции

// Вовзращает максимальный размер группы.
// 
// Параметры:
//  ГруппаТС - СправочникСсылка.гкс_ГруппыТС - Группа ТС
// 
// Возвращаемое значение:
//  Число - Максимальный размер группы
//
Функция МаксимальныйРазмерГруппы(ГруппаТС) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаТС, "МаксимальныйРазмерГруппы");
	
КонецФункции

// Проверка на возможное добавление в группу по размеру группы.
// 
// Параметры:
//  ГруппаТС - СправочникСсылка.гкс_ГруппыТС - ссылка на группу ТС
// 
// Возвращаемое значение:
//  Булево - Возможно добавление в группу
//
Функция ВозможноДобавлениеВГруппуПоРазмеру(ГруппаТС) Экспорт 
	
	Если Не ЗначениеЗаполнено(ГруппаТС) Тогда	
		ВызватьИсключение "Не указана группа для определения размера";	
	КонецЕсли;
	
	МаксимальныйРазмер = МаксимальныйРазмерГруппы(ГруппаТС);
	
	Если МаксимальныйРазмер = 0 
		ИЛИ ТекущийРазмерГруппы(ГруппаТС) < МаксимальныйРазмер Тогда
			
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет регистрацию на ПЛК в состав группы.
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - Документ регистрации
//  ГруппаТС - СправочникСсылка.гкс_ГруппыТС - группа ТС для включения
//
Процедура ДобавитьВСоставГруппы(ДокументРегистрации, ГруппаТС) Экспорт
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("ГруппаТС", ГруппаТС);
	СтруктураЗаписи.Вставить("РегистрацияТранспорта", ДокументРегистрации);
	СтруктураЗаписи.Вставить("ТранспортноеСредство", 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистрации, "ТранспортноеСредство"));
	СтруктураЗаписи.Вставить("МестнаяДата", ТекущаяДатаСеанса());
	
	гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "гкс_СоставГруппТранспорта");
	
КонецПроцедуры

// проверяет завершенность промежуточный композит предыдущей группы регистрации изавершен.
// 
// Параметры:
//  ГруппаТС - ДокументСсылка.гкс_РегистрацияНаПЛК - регистраия транспорта
// 
// Возвращаемое значение:
//  Булево - Истина, если промежуточный композит группы не завершен
//
Функция ПромежуточныйКомпозитПредыдущейГруппыРегистрацииНеЗавершен(ДокументРегистрации) Экспорт
	
	ГруппаТС = Справочники.гкс_ГруппыТС.ГруппаРегистрации(ДокументРегистрации);
		
	// проверка на наличие завершенного промежуточного композита на группу
	Если ЗначениеЗаполнено(ГруппаТС) Тогда
		
		ПредыдущаяГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаТС, "ПредыдущаяГруппа");
		
		Результат = ЗначениеЗаполнено(ПредыдущаяГруппа) 
			И Не ПромежуточныйКомпозитГруппыЗавершен(ПредыдущаяГруппа);
	Иначе		
		Результат = Ложь;		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	
	
// проверяет завершенность промежуточный композит группы завершен.
// 
// Параметры:
//  ГруппаТС - СправочникСсылка.гкс_ГруппыТС, Неопределено - Группа ТС
// 
// Возвращаемое значение:
//  Булево - Истина, если промежуточный композит группы завершен
//
Функция ПромежуточныйКомпозитГруппыЗавершен(ГруппаТС) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставГруппТранспорта.РегистрацияТранспорта КАК РегистрацияТранспорта
		|ПОМЕСТИТЬ ВТ_СоставГруппы
		|ИЗ
		|	РегистрСведений.гкс_СоставГруппТранспорта КАК СоставГруппТранспорта
		|ГДЕ
		|	СоставГруппТранспорта.ГруппаТС = &ГруппаТС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СоставГруппы.РегистрацияТранспорта КАК РегистрацияТранспорта,
		|	ВЫБОР
		|		КОГДА ДокументЛабораторныйАнализ.Статус ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК АнализЗавершен
		|ИЗ
		|	ВТ_СоставГруппы КАК ВТ_СоставГруппы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК ПоказателиУсиленногоКонтроляПоРегистрации
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ДокументЛабораторныйАнализ
		|			ПО ПоказателиУсиленногоКонтроляПоРегистрации.ЛабораторныйАнализ = ДокументЛабораторныйАнализ.Ссылка
		|				И (ДокументЛабораторныйАнализ.Статус = ЗНАЧЕНИЕ(Перечисление.гкс_СтатусыЛабораторногоАнализа.Выполнен))
		|		ПО ВТ_СоставГруппы.РегистрацияТранспорта = ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации
		|			И (ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит))
		|			И (ПоказателиУсиленногоКонтроляПоРегистрации.ТипПробы = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыПроб.Композитная))
		|ИТОГИ
		|	МАКСИМУМ(АнализЗавершен)
		|ПО
		|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("ГруппаТС", ГруппаТС);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		
		ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаОбщийИтог.Следующий();		// Общий итог
		Результат = ВыборкаОбщийИтог.АнализЗавершен;
		
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается для формирования состава полей, из которых формируется 
// представление справочника транспортных средств.
//
// Параметры:
//  Поля                 - Массив Из Строка - массив, содержащий имена полей, 
//  						которые нужны для формирования представления объекта или ссылки.
//  						
//  СтандартнаяОбработка - Булево - в данный параметр передается признак выполнения стандартной 
//  								(системной) обработки события.
//                                	Если в теле процедуры-обработчика установить данному параметру значение Ложь,
//                                  стандартная обработка события производиться не будет.
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) Экспорт 
	
	Поля.Добавить("НомерГруппыПоставщика");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Вызывается при получении представления справочника транспортных средств.
//
// Параметры:
//  Данные               - Структура - содержит значения полей, из которых формируется представление.
//  Представление        - Строка - в данный параметр нужно поместить сформированное представление.
//  СтандартнаяОбработка - Булево - в данный параметр передается признак формирования стандартного представления.
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	ДанныеДляПредставления = Новый Массив;
	
	ДобавитьПоле(ДанныеДляПредставления, СтрШаблон("группа: %1", Данные.НомерГруппыПоставщика));
		
	Представление = СтрСоединить(ДанныеДляПредставления, ";");
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создать группу усиленного контроля.
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - Документ регистрации
//  ПроизводственныеСутки - Дата - Производственные сутки
//  РазмерГруппы - Число - Размер группы
//  ПредыдущаяГруппа - СправочникСсылка.гкс_ГруппыТС - ссылка на предыдущую группу по поставщику и номенклатуре
// 
// Возвращаемое значение:
//  СправочникСсылка.гкс_ГруппыТС - ссылка на созданный элемент справочника
//
Функция НоваяГруппаУсиленногоКонтроля(ДокументРегистрации, ПроизводственныеСутки, 
		ПредыдущаяГруппа, РазмерГруппы = 0)
		
	ДанныеЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегистрации,
		"ТочкаМаршрута, Контрагент, Номенклатура");
	
	НомерГруппы = КоличествоГруппПоставщикаЗаСутки(ПроизводственныеСутки, ДанныеЗаполнения.Контрагент, 
		ДанныеЗаполнения.Номенклатура, ДанныеЗаполнения.ТочкаМаршрута) + 1;
		
	ДанныеЗаполнения.Вставить("ПроизводственныеСутки", ПроизводственныеСутки);
	ДанныеЗаполнения.Вставить("МаксимальныйРазмерГруппы", РазмерГруппы);
	ДанныеЗаполнения.Вставить("ГоловаГруппы", ДокументРегистрации);
	ДанныеЗаполнения.Вставить("ПредыдущаяГруппа", ПредыдущаяГруппа);
	ДанныеЗаполнения.Вставить("ДатаСоздания", ТекущаяУниверсальнаяДата());
	ДанныеЗаполнения.Вставить("НомерГруппыПоставщика", НомерГруппы);
	
    ГруппаТС = СоздатьЭлемент();
	ГруппаТС.Заполнить(ДанныеЗаполнения);
	ГруппаТС.Записать();
	
	Возврат ГруппаТС.Ссылка;
		
КонецФункции

Функция КоличествоГруппПоставщикаЗаСутки(ПроизводственныеСутки, Контрагент, Номенклатура, ТочкаМаршрута)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГруппыТС.Ссылка) КАК КоличествоГрупп
	|ИЗ
	|	Справочник.гкс_ГруппыТС КАК ГруппыТС
	|ГДЕ
	|	ГруппыТС.ПроизводственныеСутки = &ПроизводственныеСутки
	|	И ГруппыТС.Контрагент = &Контрагент
	|	И ГруппыТС.Номенклатура = &Номенклатура
	|	И ГруппыТС.ТочкаМаршрута = &ТочкаМаршрута";
	
	Запрос.УстановитьПараметр("ПроизводственныеСутки", ПроизводственныеСутки);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Результат = 0;	
	Иначе	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.КоличествоГрупп;	
	КонецЕсли;
	
    Возврат Результат;
	
КонецФункции	

Процедура ДобавитьПоле(МассивСтрок, ЗначениеПоля)
	
	Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
		МассивСтрок.Добавить(ЗначениеПоля);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
